[
    {
        "name": "Tech Savvy Conference 2023 (November 12, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "A day-long event aimed at getting girls interested in STEM through hands-on workshops and inspiring talks. Location: [Chicago, IL]"
    },
    {
        "name": "Girls Who Code Virtual Summer Immersion Program (Summer 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A free 2-week virtual program providing high school girls with the opportunity to learn coding skills and get exposure to tech jobs. Location: [Online]"
    },
    {
        "name": "Introduce a Girl to Engineering Day (February 22, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "Part of Engineering Week, this event provides girls with tours of engineering labs, mentorship, and interactive sessions. Location: [Various Locations - Check Local Listings]"
    },
    {
        "name": "Society of Women Engineers (SWE) Annual Conference (October 25-27, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "The world’s largest conference for women engineers and technologists offering career development, networking, and mentoring. Location: [Los Angeles, CA]"
    },
    {
        "name": "Out in STEM Conference (oSTEM) 2023 (November 16-19, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "An annual summit for LGBTQ+ individuals in STEM fields, featuring workshops, panels, and networking opportunities. Location: [Anaheim, CA]"
    },
    {
        "name": "Scientista Symposium 2024 (April 6-7, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A national conference bringing together women across STEM disciplines for professional development, inspiring speeches, and networking. Location: [Cambridge, MA]"
    },
    {
        "name": "NASA GLOBE Virtual Student Conference (March 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "An online event where students present STEM research and projects in environmental science to peers and experts. Location: [Online]"
    },
    {
        "name": "WiSTEM Week 2024 (May 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A week-long series of webinars and workshops celebrating women in STEM with a focus on career paths and skill-building. Location: [Online]"
    },
    {
        "name": "GirlCon Tech Conference (June 28-30, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A conference aimed at empowering the next generation of female leaders in tech through workshops, speaker sessions, and networking. Location: Chicago, IL."
    },
    {
        "name": "SheTech Explorer Day (April 12, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A day-long event where high school girls explore STEM careers through hands-on activities and mentoring opportunities. Location: Online."
    },
    {
        "name": "Girls Who Code Summer Immersion Program (June 17 - August 9, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A free, two-week virtual summer program for current 9th-11th grade students to learn coding and get exposure to tech jobs. Location: Online."
    },
    {
        "name": "TechGirls Exchange Program (July 7 - July 28, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "An international exchange program that aims to empower girls from the Middle East and North Africa through STEM education and cultural exchange. Location: Washington, D.C., and various U.S. cities."
    },
    {
        "name": "Introduce a Girl to Engineering Day (February 22, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "Part of National Engineers Week, this event invites young girls to explore engineering through guided activities and mentorship opportunities. Location: Various locations nationwide."
    },
    {
        "name": "Women in Science and Engineering (WISE) Symposium (March 21, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A symposium bringing together leading female scientists and engineers to discuss research, share insights, and network. Location: Online."
    },
    {
        "name": "STEMinist Fair (May 5, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "An online fair providing resources, workshops, and networking opportunities for young women interested in STEM. Location: Online."
    },
    {
        "name": "Ada Lovelace Day Live! (October 17, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "Celebrate women in STEM with talks, performances, and showcases of achievements. Location: Online"
    },
    {
        "name": "Grace Hopper Celebration (October 19-22, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "The world's largest gathering of women in computing. Location: Orlando, Florida"
    },
    {
        "name": "Girlstart STEM Extravaganza (October 21, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "Hands-on STEM experiences for girls of all ages. Location: Austin, Texas"
    },
    {
        "name": "SciFest All Access (October 23-29, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "A virtual science festival offering a variety of interactive STEM activities. Location: Online"
    },
    {
        "name": "Society of Women Engineers (SWE) Annual Conference (October 26-28, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "Focused on empowering women in engineering and technology. Location: Los Angeles, California"
    },
    {
        "name": "Girls Who Code Virtual Graduation (October 30, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "Celebrate the success of young girls who have completed coding programs. Location: Online"
    },
    {
        "name": "Women in STEM Conference (November 5, 2023)",
        "date": "TBD",
        "location": "Online",
        "description": "A conference dedicated to supporting and connecting women in STEM fields. Location: Online"
    },
    {
        "name": "International Day of Women and Girls in Science (February 11, 2024)",
        "date": "TBD",
        "location": "Online",
        "description": "A global celebration recognizing the critical role women and girls play in science and technology. Location: Various locations worldwide and Online"
    },
    {
        "name": "Girls in Tech Catalyst Conference (October 25-26, 2025)",
        "date": "TBD",
        "location": "Online",
        "description": "A global conference dedicated to empowering women in technology. Location: Online"
    },
    {
        "name": "She Engineers Summit (November 1, 2025)",
        "date": "TBD",
        "location": "Online",
        "description": "A conference focused on women in engineering, offering workshops and networking opportunities. Location: Boston, MA"
    },
    {
        "name": "Women in STEM Leadership Symposium (November 10, 2025)",
        "date": "TBD",
        "location": "Online",
        "description": "An event designed to inspire and cultivate leadership among women in STEM fields. Location: San Francisco, CA"
    },
    {
        "name": "Girls Who Code Winter Immersion Program Application Deadline (November 15, 2025)",
        "date": "TBD",
        "location": "Online",
        "description": "A program for high school girls interested in learning computer science skills during the upcoming winter break. Location: Various cities and online options"
    },
    {
        "name": "Tech Together Hackathon (December 6-8, 2025)",
        "date": "TBD",
        "location": "Online",
        "description": "A hackathon aimed at promoting diversity in technology, welcoming students of all skill levels. Location: Online"
    },
    {
        "name": "Society of Women Engineers Annual Conference (December 16-18, 2025)",
        "date": "TBD",
        "location": "Online",
        "description": "The world’s largest conference and career fair for women in engineering and technology. Location: Los Angeles, CA"
    }
]